core/app/Http/Controllers/Admin/AdminController.php

    public function dashboard()
    {

        $pageTitle        = 'Dashboard';
        $magasinCount      = Magasin::count();
        $magasins         = Magasin::orderBy('name', 'ASC')->take(5)->get();
        $livraisonInfoCount = LivraisonInfo::count();
        $managerCount     = User::manager()->count();
        $totalIncome      = LivraisonPayment::where('status', Status::PAID)->sum('final_amount');
        $sentInQueue      = LivraisonInfo::where('status', Status::COURIER_QUEUE)->count();
        $shippingLivraison  = LivraisonInfo::where('status', Status::COURIER_DISPATCH)->count();
        $deliveryInQueue  = LivraisonInfo::where('status', Status::COURIER_DELIVERYQUEUE)->count();
        $delivered        = LivraisonInfo::where('status', Status::COURIER_DELIVERED)->count();

        // user Browsing, Country, Operating Log
        $userLoginData = UserLogin::where('created_at', '>=', Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);
---
select count(*) as aggregate from `magasins`
select * from `magasins` order by `name` asc limit 5
select count(*) as aggregate from `livraison_infos`
select sum(`final_amount`) as aggregate from `livraison_payments` where `status` = 1
select count(*) as aggregate from `livraison_infos` where `status` = 0
select count(*) as aggregate from `livraison_infos` where `status` = 1
select count(*) as aggregate from `livraison_infos` where `status` = 2
select count(*) as aggregate from `livraison_infos` where `status` = 3
select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2024-01-02 06:12:38'