core/app/Http/Controllers/Admin/ArrivageController.php

select * from `fermes`
select * from `bandes` where (`numero_bande` LIKE '%%') order by `id` desc
select * from `fermes` where `fermes`.`id` in (1, 2, 4)
select * from `arrivages` order by `id` desc limit 20 offset 0
select * from `bandes` where `bandes`.`id` in (2, 3)
select count(*) as aggregate from `arrivages`
---
    public function index()
    {
        $pageTitle      = "Gestion des arrivages";
        $fermes = Ferme::get();
        $bandes = Bande::dateFilter()->searchable(['numero_bande'])
                                ->latest('id')
                                ->with('ferme')
                                ->get();
        $arrivages = Arrivage::dateFilter()->searchable([])
                                ->latest('id')
                                ->with('bande')
                                ->paginate(getPaginate());

select * from `fermes`
select * from `categories`
select * from `unites` where `unites`.`id` in (1)
---
    public function create()
    {
        $pageTitle = "Ajouter une Bande";
        $fermes = Ferme::get();
        $categories = Categorie::with('unite')->get();

select * from `bandes` where `ferme_id` = '2'
---
    public function getBande()
    {
        $id = request()->ferme;
        $bandes = Bande::where('ferme_id', $id)->get();

select * from `arrivages` where `arrivages`.`id` = '2' limit 1
select * from `bandes` where (`ferme_id` = '4' and `numero_bande` = '3') limit 1
---
    public function store(Request $request)
    {
        $validationRule = [
            'total' => 'required',
            'bande' => 'required',
            'date_arrivage' => 'required',
            'unite' => 'required|array',
            'categorie' => 'required|array',
            'price' => 'required|array',
            'quantite' => 'required|array'
        ];
        $request->validate($validationRule);

        if($request->id) {
            $arrivage = Arrivage::findOrFail($request->id);
            $message = "L'arrivage a été mise à jour avec succès";

        } else {
            $arrivage = new Arrivage();
        }
        $arrivage->total_poulet = $request->total;
        $arrivage->total_restant = $request->total;
        $arrivage->date_arrivage =  $request->date_arrivage;
        //Verification de l'existance du numero de bande
        $verif = Bande::where([['ferme_id',$request->ferme],['numero_bande',$request->bande]])->first();

insert into `bandes` (`ferme_id`, `numero_bande`, `updated_at`, `created_at`) values ('4', '3', '2024-02-01 22:11:44', '2024-02-01 22:11:44')
insert into `arrivages` (`total_poulet`, `date_arrivage`, `bande_id`, `updated_at`, `created_at`) values ('750', '2024-02-01', 3, '2024-02-01 21:56:34', '2024-02-01 21:56:34')
update `arrivages` set `bande_id` = 4, `arrivages`.`updated_at` = '2024-02-01 22:11:44' where `id` = 2
delete from `produits` where `arrivage_id` = 2
---
            $band = new Bande();
            $band->ferme_id = $request->ferme;
            $band->numero_bande = $request->bande;
            $band->save();
            $bande_id = $band->id;
        }
        $arrivage->bande_id = $bande_id;
        $arrivage->save();
        if($arrivage->id !=null){
            $id = $arrivage->id;
            if($request->quantite !=null) {
                Produit::where('arrivage_id',$id)->delete();

select * from `unites` where `id` = '1' limit 1
select * from `categories` where `id` = '1' limit 1
---
                    if($qte==null){
                        continue;
                    }
                    $unit = Unite::where('id',$unite[$key])->first();
                    $categ = Categorie::where('id',$categorie[$key])->first();

insert into `produits` (`arrivage_id`, `quantity`, `categorie_id`, `price`, `name`, `updated_at`, `created_at`) values (2, '720', '1', '2700', 'POULET DE CHAIR-POULET MAXI', '2024-02-01 22:11:44', '2024-02-01 22:11:44')
---
                    $produit->categorie_id = $categorie[$key];
                    $produit->price = $price[$key];
                    $produit->name = $unit->name.'-'.$categ->name;
                    $produit->save();

select * from `arrivages` where `arrivages`.`id` = '2' limit 1
select * from `fermes`
---
    public function edit($id)
    {
        $arrivage = Arrivage::find($id);
        $fermes = Ferme::get();