core/app/Http/Controllers/Admin/BandeController.php

    public function index()
    {
        //
        $pageTitle      = "Gestion des bandes";
        $fermes = Ferme::get();
        $bandes = Bande::dateFilter()->searchable(['numero_bande'])
                                ->latest('id')
                                ->with('ferme')
                                ->paginate(getPaginate());
---
select * from `fermes`
select * from `bandes` where (`numero_bande` LIKE '%%') order by `id` desc limit 20 offset 0
select * from `fermes` where `fermes`.`id` in (1, 2)
select count(*) as aggregate from `bandes` where (`numero_bande` LIKE '%%')

    public function create()
    {
        //
        $pageTitle = "Ajouter une Bande";
        $fermes = Ferme::get();
---
select * from `fermes`

    public function store(Request $request)
    {
        $request->validate([
            'numero' => 'required',
            'ferme' => 'required'
        ]);
        if ($request->id) {
            $bande  = Bande::findOrFail($request->id);
---
select * from `bandes` where `bandes`.`id` = '4' limit 1