core/app/Http/Controllers/Admin/FermeController.php

select * from `fermes` where (`nom` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `fermes` where (`nom` LIKE '%%')
---
    public function index()
    {
        //
        $pageTitle      = "Gestion des fermes";
        $fermes = Ferme::dateFilter()->searchable(['nom'])
                                ->latest('id')
                                ->paginate(getPaginate());