core/app/Http/Controllers/Admin/LivraisonSettingController.php

    public function produitIndex()
    {
        $pageTitle = "Gestion des Produits";
        $categories     = Categorie::active()->with('unite')->orderBy('name')->get();
        $produits     = Produit::orderBy('name')->with('categorie')->paginate(getPaginate());
---
select * from `unites` where `unites`.`id` in (1)
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 7, 8, 9, 10, 11)
select * from `produits` order by `name` asc limit 20 offset 0
select count(*) as aggregate from `produits`

    public function magasinIncome()
    {
        $pageTitle     = "Historique des Revenus de Magasins";
        $magasins      = Magasin::active()->latest('id')->get();
        $magasinIncomes = LivraisonPayment::where('magasin_id','!=',0)->dateFilter()->filter(['magasin_id'])->where('status', Status::PAID)->select(DB::raw("*,SUM(final_amount) as totalAmount"))
            ->groupBy('magasin_id')->with('magasin')->paginate(getPaginate());
---
select * from `magasins` where `magasins`.`id` in (1)
select *,SUM(final_amount) as totalAmount from `livraison_payments` where `magasin_id` != 0 and `status` = 1 group by `magasin_id` limit 20 offset 0