core/app/Http/Controllers/Admin/LivraisonController.php

select * from `magasins`
select * from `livraison_infos` where (`code` LIKE '%%') and (exists (select * from `livraison_payments` where `livraison_infos`.`id` = `livraison_payments`.`livraison_info_id`))
select * from `magasins` where `magasins`.`id` in (1)
select count(*) as aggregate from `livraison_infos` where (`code` LIKE '%%') and (exists (select * from `livraison_payments` where `livraison_infos`.`id` = `livraison_payments`.`livraison_info_id`))
select * from `livraison_infos` where (`code` LIKE '%%') and (exists (select * from `livraison_payments` where `livraison_infos`.`id` = `livraison_payments`.`livraison_info_id`)) order by `id` desc limit 20 offset 0
---
    public function livraisonInfo()
    {
        $pageTitle    = "Informations de Livraisons";
        $staffs = User::active()->get();
        $magasins = Magasin::get();

        $livraisonInfos = LivraisonInfo::dateFilter()->searchable(['code'])->filter(['status','receiver_magasin_id','sender_magasin_id'])->where(function ($q) {
            $q->OrWhereHas('payment', function ($myQuery) {
                if(request()->payment_status != null){
                    $myQuery->where('status',request()->payment_status);
                }
            });
        })
        ->when(request()->staff, function ($query, $staff) {
            $query->where('receiver_staff_id',$staff);
        })
        ->when(request()->magasin, function ($query, $magasin) {
            $query->where('receiver_magasin_id',$magasin);
        });

        $sommeTotal = $livraisonInfos->with('paymentList')->get();
        $sommeTotal = $sommeTotal->pluck('paymentList')->collapse()->sum('final_amount');

        $livraisonInfos= $livraisonInfos->orderBy('id', 'DESC')->with('senderMagasin', 'receiverMagasin', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());