core/app/Http/Controllers/Admin/MagasinManagerController.php

select * from `users` where (`username` LIKE '%%' or `email` LIKE '%%' or `mobile` LIKE '%%' or exists (select * from `magasins` where `users`.`magasin_id` = `magasins`.`id` and `name` like '%%')) and `user_type` = 'manager' order by `id` desc limit 20 offset 0
select count(*) as aggregate from `users` where (`username` LIKE '%%' or `email` LIKE '%%' or `mobile` LIKE '%%' or exists (select * from `magasins` where `users`.`magasin_id` = `magasins`.`id` and `name` like '%%')) and `user_type` = 'manager'
select * from `magasins` where `magasins`.`id` in (1, 2)
---
    public function index()
    {
        $pageTitle      = "Tous les Managers de Magasins";
        $magasinManagers = User::searchable(['username', 'email', 'mobile', 'magasin:name'])->manager()->latest('id')->with('magasin')->paginate(getPaginate());