core/app/Http/Controllers/Admin/StaffController.php

	public function list()
	{
		$pageTitle = 'Liste des Staffs';
		$staffs = User::searchable(['username', 'email', 'mobile', 'magasin:name'])->staff()->with('magasin')->paginate(getPaginate());
---
select * from `users` where (`username` LIKE '%%' or `email` LIKE '%%' or `mobile` LIKE '%%' or exists (select * from `magasins` where `users`.`magasin_id` = `magasins`.`id` and `name` like '%%')) and `user_type` = 'staff' limit 20 offset 0
select count(*) as aggregate from `users` where (`username` LIKE '%%' or `email` LIKE '%%' or `mobile` LIKE '%%' or exists (select * from `magasins` where `users`.`magasin_id` = `magasins`.`id` and `name` like '%%')) and `user_type` = 'staff'
select * from `magasins` where `magasins`.`id` in (1)