core/app/Providers/AppServiceProvider.php

select count(*) as aggregate from `support_tickets` where `status` in (0, 2)
select * from `admin_notifications` where `read_status` = 0 order by `id` desc limit 10
select * from `users` where `users`.`id` in (1, 4)
select count(*) as aggregate from `admin_notifications` where `read_status` = 0
---
    public function boot()
    {
        $general                         = gs();
        $activeTemplate                  = activeTemplate();
        $viewShare['general']            = $general;
        $viewShare['activeTemplate']     = $activeTemplate;
        $viewShare['activeTemplateTrue'] = activeTemplate(true);
        // $viewShare['language']           = Language::all();
        // $viewShare['pages']              = Page::where('tempname', $activeTemplate)->where('slug', '!=', 'home')->where('is_default', Status::NO)->get();
        // $viewShare['footerPages']        = Page::where('tempname', $activeTemplate)->where('slug', '!=', 'home')->orderby('id', 'DESC')->take(3)->get();
        $viewShare['emptyMessage']       = 'Aucune donnée';


        view()->share($viewShare);

        view()->composer('admin.partials.sidenav', function ($view) {
            $view->with([
                'pendingTicketCount' => SupportTicket::whereIN('status', [Status::TICKET_OPEN, Status::TICKET_REPLY])->count(),

            ]);
        });
        view()->composer('admin.partials.topnav', function ($view) {
            $view->with([
                'adminNotifications'     => AdminNotification::where('read_status', 0)->with('user')->orderBy('id', 'desc')->take(10)->get(),
                'adminNotificationCount' => AdminNotification::where('read_status', 0)->count(),
            ]);