core/app/Http/Controllers/Manager/LivraisonController.php

insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (1, 'W3TZPU5Q8N8R La livraison a été mise à jour par abenan1', '/admin/livraison/details/3', '2024-02-03 11:32:39', '2024-02-03 11:32:39')
---
            $adminNotification->user_id   = $sender->id;
            $adminNotification->title     = $livraison->code . ' Paiement Livraison Updated  by ' . $user->username;
            $adminNotification->click_url = urlPath('admin.livraison.info.details', $livraison->id);
            $adminNotification->save();

select * from `produits` where `produits`.`id` in (12, 16, 18, 19)
---
    public function edit($id)
    {

        $pageTitle   = 'Modifier de Livraison';
        $id = decrypt($id);
        $user = auth()->user();
        $magasins = Magasin::active()->orderBy('name')->get();
        $produits = Produit::active()->with('categorie')->orderBy('name')->get();