core/app/Http/Controllers/Manager/LivraisonController.php

select * from `users` where `status` = 1 and `user_type` = 'staff' order by `lastname` asc
select * from `magasins` where `magasins`.`id` in (1)
select * from `arrivages` where `arrivages`.`id` in (1, 2)
select * from `bandes` where `bandes`.`id` in (2, 4)
select `produits`.* from `produits` inner join `arrivages` on `produits`.`arrivage_id` = `arrivages`.`id` where `quantity_restante` > 0 group by `bande_id`
---
    public function create()
    {
        $pageTitle = 'Enregistrer une Livraison';
        $staff = auth()->user();
        $magasins = Magasin::active()->orderBy('name')->get();
        $clients = Client::active()->orderBy('name')->get();
        $staffs = User::active()->where('user_type','staff')->with('magasin')->orderBy('lastname')->get();
        $produits = Produit::joinRelationship('arrivage')->where('quantity_restante','>',0)->groupby('bande_id')->with('arrivage.bande')->get();

select * from `clients` where `clients`.`id` = '162' limit 1
---
            $client->save();
            $livraison->receiver_client_id = $client->id;
        }else{
            $client = Client::find($request->client);

select * from `produits` where `id` = '12' limit 1
---
            $livraisonProduit->save();

            if($livraisonProduit->id !=null){
                $product = Produit::where('id',$produitId)->first();

insert into `livraison_payments` (`livraison_info_id`, `amount`, `discount`, `final_amount`, `frais_livraison`, `percentage`, `status`, `updated_at`, `created_at`) values (3, 3144400, '5000', 3140400, '1000', '5000', '0', '2024-02-03 00:58:47', '2024-02-03 00:58:47')
---
        $livraisonPayment->frais_livraison = $request->frais_livraison;
        $livraisonPayment->percentage      = $discount;
        $livraisonPayment->status          = $request->payment_status;
        $livraisonPayment->save();

insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (1, 'Nouvelle livraison créée par abenan1', '/admin/livraison/details/3', '2024-02-03 00:58:47', '2024-02-03 00:58:47')
---
        $adminNotification->user_id   = $sender->id;
        $adminNotification->title     = 'Nouvelle livraison créée par ' . $sender->username;
        $adminNotification->click_url = urlPath('admin.livraison.info.details', $livraison->id);
        $adminNotification->save();

select `produits`.* from `produits` inner join `arrivages` on `produits`.`arrivage_id` = `arrivages`.`id` where `bande_id` in ('2') and `quantity_restante` > 0
---
    public function getProduit()
    {
        $totalrecu = 0;

        if(request()->bande !=null){

        $arrivages = Produit::joinRelationship('arrivage')->whereIn('bande_id', request()->bande)->where('quantity_restante','>',0)->get();

select * from `livraison_infos` where `livraison_infos`.`id` = 3 limit 1
---
    public function update(Request $request, $id)
    {

        $id = decrypt($id);

        $request->validate([
            'magasin'           => 'required|exists:magasins,id',
            'staff'           => 'required|exists:users,id',
            'sender_name'      => 'required|max:255',
            'sender_email'     => 'required|email|max:255',
            'sender_phone'     => 'required|string|max:255',
            'receiver_name'    => 'required|max:255',
            'receiver_phone'   => 'required|string|max:255',
            'receiver_address' => 'required|max:255',
            'items'            => 'required|array',
            'items.*.produit'     => 'required|integer|exists:produits,id',
            'items.*.quantity' => 'required|numeric|gt:0',
            'items.*.amount'   => 'required|numeric|gt:0',
            'items.*.name'     => 'nullable|string',
            'estimate_date'    => 'required|date|date_format:Y-m-d|after_or_equal:today',
            'payment_status'   => 'required|integer|in:0,1',
        ]);

        $sender                      = auth()->user();
        $livraison                     = LivraisonInfo::findOrFail($id);

select * from `livraison_payments` where `livraison_payments`.`livraison_info_id` in (3)
---
        $user = auth()->user();
        if ($request->payment_status == Status::PAID || $request->payment_status == Status::UNPAID) {

            $livraisonPayment               = LivraisonPayment::where('livraison_info_id', $livraison->id)->first();

select * from `produits` where `produits`.`id` in (12, 16, 18, 19)
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select * from `users` where `status` = 1 and `user_type` = 'staff' order by `lastname` asc
select * from `magasins` where `magasins`.`id` in (1)
select * from `livraison_infos` where `sender_magasin_id` = 1 and `id` = 3 limit 1
---
    public function edit($id)
    {

        $pageTitle   = 'Modifier de Livraison';
        $id = decrypt($id);
        $user = auth()->user();
        $magasins = Magasin::active()->orderBy('name')->get();
        $produits = Produit::active()->with('categorie')->orderBy('name')->get();
        $clients = Client::active()->orderBy('name')->get();
        $staffs = User::active()->where('user_type','staff')->with('magasin')->orderBy('lastname')->get();

        $livraisonInfo = LivraisonInfo::with('products.produit', 'payment')->where('sender_magasin_id', $user->magasin_id)->where('id', $id)->firstOrFail();

select * from `categories` where `categories`.`id` in (2, 3, 5, 6, 7, 8, 10)
select * from `livraison_infos` where `livraison_infos`.`id` = 2 limit 1
select * from `produits` where `produits`.`id` in (13, 14, 15, 16, 17, 18, 20)
---
    public function invoice($id)
    {
        $pageTitle = 'Facture';
        $livraisonInfo = LivraisonInfo::with('products.produit.categorie', 'payment')->findOrFail(decrypt($id));

select * from `users` where `status` = 1 and (`user_type` = 'staff' and `magasin_id` = 1) order by `lastname` asc
---
    public function deliveryQueue()
    {
        $pageTitle    = 'En attente de Reception';
        $user = auth()->user();
        $livraisonLists = $this->livraisons('deliveryQueue');
        $sommeTotal = $livraisonLists->pluck('paymentList')->collapse()->sum('final_amount');

        $staffs = User::active()->where([['user_type','staff'],['magasin_id',$user->magasin_id]])->orderBy('lastname')->get();

select * from `livraison_infos` where `receiver_magasin_id` = 1 and `status` = 2 and (`code` LIKE '%%') and (exists (select * from `livraison_payments` where `livraison_infos`.`id` = `livraison_payments`.`livraison_info_id`)) order by `livraison_infos`.`id` desc limit 20 offset 0
select * from `magasins` where `magasins`.`id` in (1)
select count(*) as aggregate from `livraison_infos` where `receiver_magasin_id` = 1 and `status` = 2 and (`code` LIKE '%%') and (exists (select * from `livraison_payments` where `livraison_infos`.`id` = `livraison_payments`.`livraison_info_id`))
---
    protected function livraisons($scope = null)
    {
        $user = auth()->user();
        $livraisons = LivraisonInfo::where(function ($query) use ($user) {
            $query->Where('receiver_magasin_id', $user->magasin_id);
        });
        if ($scope) {
            $livraisons = $livraisons->$scope();
        }

        $livraisons = $livraisons->dateFilter()->searchable(['code'])->with('senderMagasin', 'receiverMagasin', 'senderStaff', 'receiverStaff', 'paymentInfo','paymentList')
        ->when(request()->staff, function ($query, $staff) {
            $query->where('receiver_staff_id',$staff);
        })
        ->when(request()->status, function ($query, $status) {
             $query->where('status',$status);
        })
        ->where(function ($q) {
            $q->OrWhereHas('payment', function ($myQuery) {
                if(request()->payment_status != null){
                    $myQuery->where('status',request()->payment_status);
                }
            });
        })
        ->orderBy('livraison_infos.id','DESC')
        ->paginate(getPaginate());