core/app/Http/Controllers/Manager/LivraisonController.php

select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
---
    public function create()
    {
        $pageTitle = 'Enregistrer une Livraison';
        $staff = auth()->user();
        $magasins = Magasin::active()->orderBy('name')->get();
        $produits = Produit::active()->with('categorie')->orderBy('name')->get();

insert into `livraison_products` (`livraison_info_id`, `livraison_produit_id`, `qty`, `fee`, `type_price`, `updated_at`, `created_at`) values (3, '12', '452', 1220400, '2700', '2024-02-03 00:58:47', '2024-02-03 00:58:47')
---
            $livraisonProduit->save();
        }

        LivraisonProduct::insert($data);

select * from `magasins` where `magasins`.`id` in (1)
---
    public function upcoming()
    {
        $pageTitle    = 'Livraison Encours';
        $user         = auth()->user();
        $livraisonLists = LivraisonInfo::dateFilter()->searchable(['code'])->where('receiver_magasin_id', $user->magasin_id)->where('status', Status::COURIER_UPCOMING)->orderBy('id', 'DESC')
            ->with('senderMagasin', 'receiverMagasin', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());

select * from `livraison_infos` where `sender_magasin_id` = 1 and `id` = 3 limit 1
---
    public function dispatched($id)
    {
        $user                = auth()->user();
        $livraisonInfo         = LivraisonInfo::where('sender_magasin_id', $user->magasin_id)->findOrFail($id);

select * from `livraison_payments` where `livraison_payments`.`livraison_info_id` in (2)
---
    public function credit()
    {
        $pageTitle    = 'Livraison à Crédit';
        $user = auth()->user();
        $livraisonLists = LivraisonPayment::dateFilter()->joinRelationship('info')
        ->where([['livraison_infos.status', Status::COURIER_DELIVERED]])
        ->where('livraison_payments.status', '!=',1)
        ->when(request()->staff, function ($query, $staff) {
            $query->where('receiver_staff_id',$staff);
        })
        ->when(request()->magasin, function ($query, $magasin) {
             $query->where('livraison_infos.status',$magasin);
        })
        ->when(request()->payment_status, function ($query, $payment_status) {