core/app/Http/Controllers/Manager/LivraisonSettingController.php

    public function produitIndex()
    {
        $pageTitle = "Gestion des Produits";
        $categories     = Categorie::active()->orderBy('name')->get();
        $produits     = Produit::orderBy('name')->where('quantity_restante','>',0)->with('categorie')->paginate(getPaginate());
---
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `produits` where `quantity_restante` > 0 order by `name` asc limit 20 offset 0
select count(*) as aggregate from `produits` where `quantity_restante` > 0

    public function clientIndex()
    {
        $pageTitle = "Gestion des Clients";
        $clients     = Client::searchable(['name', 'genre','email','phone','address'])->orderBy('id','desc')->paginate(getPaginate());
---
select * from `clients` where (`name` LIKE '%%' or `genre` LIKE '%%' or `email` LIKE '%%' or `phone` LIKE '%%' or `address` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `clients` where (`name` LIKE '%%' or `genre` LIKE '%%' or `email` LIKE '%%' or `phone` LIKE '%%' or `address` LIKE '%%')