core/app/Http/Controllers/Manager/ManagerController.php

select count(*) as aggregate from `livraison_infos` where `sender_magasin_id` = 1 and `status` != 0
select sum(`final_amount`) as aggregate from `livraison_payments` where `magasin_id` = 1 and `status` = 1
---
    public function dashboard()
    {
        $manager            = auth()->user();
        $pageTitle          = "Manager Dashboard";
        $magasinCount        = Magasin::active()->count();
        $livraisonShipCount   = LivraisonInfo::dispatched()->count();
        $upcomingCount      = LivraisonInfo::upcoming()->count();
        $livraisonInfoCount   = $this->livraisons()->count();
        $livraisonQueueCount  = LivraisonInfo::queue()->count();
        $deliveryQueueCount = LivraisonInfo::deliveryQueue()->count();
        $totalSentCount     = LivraisonInfo::where('sender_magasin_id', $manager->magasin_id)->where('status', '!=', Status::COURIER_QUEUE)->count();

        $livraisonDelivered = LivraisonInfo::delivered()->count();
        $totalStaffCount  = User::staff()->where('magasin_id', $manager->magasin_id)->count();
        $magasinIncome     = LivraisonPayment::where('magasin_id', $manager->magasin_id)->where('status', Status::PAID)->sum('final_amount');

select count(*) as aggregate from `livraison_infos` where (`sender_magasin_id` = 1 or `receiver_magasin_id` = 1) and (`code` LIKE '%%')
---
    protected function livraisons($scope = null)
    {
        $user     = auth()->user();
        $livraisons = LivraisonInfo::where(function ($query) use ($user) {
            $query->where('sender_magasin_id', $user->magasin_id)->orWhere('receiver_magasin_id', $user->magasin_id);
        });
        if ($scope) {
            $livraisons = $livraisons->$scope();
        }
        $livraisons = $livraisons->dateFilter()->searchable(['code'])->with('senderMagasin', 'receiverMagasin', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());