core/app/Http/Controllers/Manager/StaffController.php

select * from `users` where (`username` LIKE '%%' or `email` LIKE '%%' or `mobile` LIKE '%%') and (`user_type` = 'staff' and `magasin_id` = 1) order by `id` desc limit 20 offset 0
select count(*) as aggregate from `users` where (`username` LIKE '%%' or `email` LIKE '%%' or `mobile` LIKE '%%') and (`user_type` = 'staff' and `magasin_id` = 1)
select * from `magasins` where `magasins`.`id` in (1)
---
    public function index()
    {
        $pageTitle = "Tous les Staffs";
        $manager   = auth()->user();
        $staffs    = User::searchable(['username', 'email', 'mobile'])->where(function ($query) use ($manager) {
            $query->staff()->where('magasin_id', $manager->magasin_id);
        })->with('magasin')->orderBy('id', 'DESC')->paginate(getPaginate());